# !/usr/bin/env python
# -*- coding: utf-8 -*-

# author: humingk
# ----------------------

# 豆瓣电影 + subject ID
URL_MOVIE_DOUBAN = 'https://movie.douban.com/subject/'

# 电影类型 下标即为其ID
TYPE_MOVIE_LIST = [
    '',
    '未知',
    '剧情',
    '喜剧',
    '爱情',
    '动作',
    '惊悚',
    '动画',
    '犯罪',
    '纪录片',
    '短片',
    '恐怖',
    '悬疑',
    '科幻',
    '冒险',
    '奇幻',
    '家庭',
    '战争',
    '历史',
    '传记',
    '音乐',
    '同性',
    '古装',
    '歌舞',
    '运动',
    '情色',
    '儿童',
    '武侠',
    '西部',
    '真人秀',
    '黑色电影',
    '灾难',
    '脱口秀',
    '舞台艺术',
    '戏曲',
    '鬼怪'
]
